using System;

namespace BasicTypes
{
    class Program
    {
        static void Main()
        {
            #region ЦІЛІ ТИПИ

            // 8-bits == 1 byte. ----------------------------------------------------------------------------

            // Ціле число без знака. Діапазон - від 0 до 255.
            byte a = 0;
            Byte b = 255;

            // Ціле число зі знаком. Діапазон - від -128 до +127.
            sbyte c = -128;
            SByte d = +127;


            // 16-bits == 2 bytes. -------------------------------------------------------------------------

            // Ціле число без знака. Діапазон - від 0 до 65535.
            ushort e = 0;
            UInt16 f = 65535;

            // Ціле число зі знаком. Діапазон - від -32768 до +32767.
            short g = -32768;
            Int16 h = +32767;


            // 32-bits = 4 bytes. ---------------------------------------------------------------------------

            // Ціле число без знака. Діапазон - від 0 до 4294967295.
            uint i = 0u;
            UInt32 j = 4294967295U;

            // Ціле число зі знаком. Діапазон - від -2147483648 до +2147483647.
            int k = -2147483648;
            Int32 l = +2147483647;


            // 64-bits = 8 bytes. ---------------------------------------------------------------------------

            // Ціле число без знака. Діапазон - від 0 до +18446744073709551615.
            ulong m = 0ul;
            UInt64 n = 18446744073709551615UL;

            // Ціле число зі знаком. Діапазон - від -9223372036854775808 до +9223372036854775807.
            long o = -9223372036854775808L;
            Int64 p = +9223372036854775807L;

            #endregion


            #region ДІЙСНІ ТИПИ

            // Дійсні типи призначені для представлення дробових чисел.

            // 32-bits = 4 bytes. ---------------------------------------------------------------------------

            // Дійсні зі знаком. Діапазон - від +/-1.5 x 10^-45 до +/-3.4 x 10^38.
            float q = -0.123456789f;  // Добавлення суфікса f, є обов'язковим,
            Single r = +1.123456789F; // тому що, компілятор інтерпретує дане число як double.


            // 64-bits = 8 bytes. ---------------------------------------------------------------------------

            // Дійсні зі знаком. Діапазон - від +/-5.0 x 10^-324 до +/-1.7 x 10^308.
            double s = -0.123456789d;
            Double t = +1.123456789;

            #endregion


            #region ДЕСЯТКОВИЙ ТИП

            // 128-bits = 16 bytes. -----------------------------------------------------------------------

            // Десяткове зі знаком. Діапазон - від від +/- 1.0 x 10 ^ -28 до +/- 7.9 x 10 ^ 28.
            decimal u = -0.12345m;   // Добавдення суфікса m, є обов'язковим,
            Decimal v = +1.1234567M; // тому що, компілятор інтерпретує дане число як double.

            #endregion


            #region ЛОГІЧНИЙ ТИП

            // 8-bits == 1 byte. ----------------------------------------------------------------------------

            // Логічна величина Істина / Брехня.
            bool w = true;
            Boolean x = false;

            #endregion


            #region СИМВОЛЬНИЙ ТИП

            // 16-bits == 2 bytes. -------------------------------------------------------------------------

            // Символ в форматі UNICODE.
            char y = 'a';
            Char z = 'A';

            #endregion


            #region СТРІЧКОВИЙ ТИП

            // Cтрічка у форматі UNICODE.
            string firstString = "hello";
            String secondString = "HELLO";

            #endregion


            // Затримка.
            Console.ReadKey();
        }
    }
}
